# Дан список А3, состоящий из четного количества элементов. Используя
# функцию (функции) высшего порядка разбейте его на списки В, С так, чтобы в
# одном были положительные элементы, а в другом отрицательные

def split_list(A3):
    B = list(filter(lambda x: x > 0, A3))
    C = list(filter(lambda x: x < 0, A3))
    return B, C


A3 = [10, -8, -3, -7, 5, -6]
B, C = split_list(A3)


print("Положительные элементы:", B)
print("Отрицательные элементы:", C)