# Дан список А3, состоящий из четного количества элементов. Используя
# функцию (функции) высшего порядка разбейте его на списки В, С так, чтобы в
# одном были положительные элементы, а в другом отрицательные

def split_list(A3):
    B = [x for x in A3 if x >= 0]
    C = [x for x in A3 if x < 0]
    return B, C

A3 = [1, -2, 3, -4, 5, -6]
B, C = split_list(A3)

print("Положительные элементы:", B)
print("Отрицательные элементы:", C)