# Дан список S состоящий из N различных элементов. Вывести индексы
# четных элементов списка. Использовать встроенные функции высшего порядка.

def even_indices(S):
    return [i for i, x in enumerate(S) if x % 2 == 0]


S = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(even_indices(S))
