# 28. Дан список S состоящий из N различных элементов. Вывести индексы
# четных элементов списка. Использовать функции высшего порядка


S = list(map(int, input("Введите список элементов через пробел: ").split()))
even_indices = list(map(lambda x: x[0], filter(lambda x: x[1] % 2 == 0, enumerate(S))))
print("Индексы четных элементов списка:", even_indices)
