# Дан список с перечнем товаров.
# Выбрать все товары, изготовленные фирмой Bosh и создать из них новый список

# Исходный список товаров
products = [
    {"товар": "дрель", "производитель": "Bosh"},
    {"товар": "молоток", "производитель": "Stanley"},
    {"товар": "отвертка", "производитель": "Bosh"},
    {"товар": "пила", "производитель": "Makita"},
    {"товар": "лобзик", "производитель": "Bosh"},
    {"товар": "плоскогубцы", "производитель": "Stanley"},
]

bosh_products = [product for product in products if product["производитель"] == "Bosh"]

for product in bosh_products:
    print(f'Производитель - {product["производитель"]}, товар - {product["товар"]}')

