from main import YakutMorph
from mappers import CoNLLU

morphology = YakutMorph()

sent = 'Итиччэтигэр, мин, улахан дьоҥҥо өйдөннүн диэн, аны, моҕой иһин курдаттыы уруһуйдаабытым.'
#sent = 'Кинилэргэ куруук быһааран биэриэх тустааххын.'
sent = 'Кинилэргэ куруук биэриэх тустааххын.'


sent = 'Дьэ, ити курдук, алта сааспар сылдьан чаҕылхай уруһуйдьут буолар дьылҕабын сарбынан турабын.'

sent = 'Дьэ, ити курдук, алта сааспар сылдьан чаҕылхай уруһуйдьут'


sent = 'уруһуйдьут'

# 1-кы уонна 2-с №-дээх уруһуйдарым хоргутууттан атын туох да ситиһиини аҕалбатахтара.'

parse = morphology.parse(sent)

token = parse.tokens[0]

print(CoNLLU(parse))