# Составить программу для нахождения числа, которое образуется из
# данного натурального числа при записи его цифр в обратном порядке. Например,
# для числа 1234 получаем результат 4321. Использовать рекурсию

import math


def reverse_num(num):
    if num < 10:
        return num
    else:
        return (num % 10) * 10 ** int(math.log10(num)) + reverse_num(num // 10)


num = int(input("Введите натуральное число: "))
result = reverse_num(num)
print("Число, образованное из цифр данного числа в обратном порядке:", result)