# Создайте класс Студент, имеющий:
# • закрытый атрибут Имя – строка, содержащая фамилию;
# • метод __init__. При создании объекта указывается имя, список
# Дисциплины пустой;
# • закрытый атрибут Дисциплины – словарь сданных дисциплин. Ключом
# является название дисциплины, значением – оценка.
# • метод put добавляет новую дисциплину в атрибут Дисциплины.
# Параметрами метода являются название дисциплины и оценка;
# • свойство Сдано возвращает список названий сданных дисциплин;
# Создайте экземпляр класса, продемонстрируйте работу с атрибутами, методами и
# свойствами

class Student:
    def __init__(self, name):
        self.__name = name
        self.__subjects = {}

    def put(self, subject, grade):
        self.__subjects[subject] = grade

    @property
    def passed(self):
        return list(self.__subjects.keys())

# Пример использования
student1 = Student("Иванов")
student1.put("Математика", "Отлично")
student1.put("Физика", "Хорошо")
student1.put("История", "Удовлетворительно")

print("Студент:", student1._Student__name)  # Доступ к закрытому атрибуту через имя класса
print("Сданные дисциплины:", student1.passed)
        